import 'package:flutter/material.dart';
import 'package:flutter/src/widgets/container.dart';
import 'package:flutter/src/widgets/framework.dart';
import 'package:youth_care/constants.dart';

class DeanSpeech extends StatelessWidget {
  const DeanSpeech({super.key});
  static String id='deanspeech';
  @override
  Widget build(BuildContext context) {
    Size size = MediaQuery.of(context).size;
    return Scaffold(
      appBar: AppBar(
        title: Text('كلمة عميد الكلية'),
        centerTitle: true,
        backgroundColor: primaryColor,
      ),
      body: SingleChildScrollView(
        child: Container(
          decoration: BoxDecoration(
            color: Colors.grey.withOpacity(0.2)
          ),
          child: Padding(
            padding:  EdgeInsets.all(size.width/30),
            child: Text(
              textAlign: TextAlign.end,
              style:TextStyle(fontSize: 20),
              'إلى زائرى موقع كلية الهندسة بشبرا – جامعة بنها إلى أبنائى طلاب الكلية إلى الأخوة أعضاء هيئة التدريس ومعاونيهم والعاملين بالكلية أرحب بحضراتكم جميعا من خلال موقع الكلية وأشكركم على التفضل بزيارة موقع الكلية الإلكترونى حيث أن العالم أصبح قرية صغيرة وهى مقولة صحيحة حيث أن سبل التواصل والمعرفة وتبادل الأفكار أصبح من أيسر الأمور وأبسطها والفضل فيها يعود إلي التقدم الهائل في تكنولوجيا الإتصالات والمعلومات، وتستخدم تكنولوجيا الإتصالات والمعلومات في التبادل العلمي والثقافي بين الشعوب ويقاس تقدم الأمم بما تمتلكه من علوم ومعرفة وإسهامات علمية وثقافية وفنية وحضارية، لذا وجب علي كل مؤسسات الدول إبراز ما لديها من حضارة وعلوم وفنون وغيرها من العلامات المميزة والسمات التى تميزها وتطرح كل هذا ليستفيد منه الجميع. ومن هنا يأتي الدور الهام لتكنولوجيا المعلومات والإتصالات بأن يتاح للمؤسسات المختلفة نافذة تطل منها علي العالم في الداخل والخارج تعرض ما لديها من مقومات بشرية ومادية وعلمية وتفتح هذه النافذة لخدمة المستخدمين سواء في الداخل أوالخارج لتوفير الوقت والجهد في الحصول علي المعلومات أوالخدمات المتاحة، وهناك العديد من الخدمات التي تقدم من خلال شبكة المعلومات وعلي نافذة تلك المؤسسات. وللإنتشار الهائل في استخدامات شبكة المعلومات أصبحت تستخدم كوسيلة معبرة عن قيمة المؤسسة ومدي تطورها ومقدرتها علي المنافسة وحيث أن كلية الهندسة بشبرا جامعة بنها هي إحدي القلاع العلمية والهندسية الهامة في بلدنا الحبيبة مصر لما تمتلكه من مقومات بشرية ومادية وعلمية وتواجدها علي الساحة العلمية منذ عام١٩٦١ وحتي الأن وهي في تقدم وتطور مستمر وتتخذ الكلية الجودة سبيلاً في سياسة العمل للسير نحو الإعتماد المحلي والدولي. لذا وجب علينا منسوبي كلية الهندسة بشبرا أن نبرز سمات الكلية وما تقدمه من خدمات في مجال التعليم والتعلم والبحث العلمي وخدمة المجتمع من خلال البوابة الإلكترونية للكلية وعلي موقع الجامعة. كلية الهندسة بشبرا تقدم خدمة التعليم الهندسي من خلال عدة تخصصات وأقسام علمية وهي قسم الهندسة الميكانيكية وقسم الهندسة الكهربائية وقسم الهندسة المعمارية وقسم هندسة المساحة وقسم الهندسة المدنية وقسم الرياضيات والفيزيقا الهندسية بالإضافة إلي البرامج الجديدة وهي برنامج الهندسة الصناعية وبرنامج هندسة الطاقة والطاقة المستدامة. والكلية تقدم خدمة الدراسات العليا منذ عام ١٩٨١وحتي الآن في التخصصات المذكورة سابقا لذلك وجب علينا أن نُعبر عن هذا المكان بالصورة الحقيقية المعبرة عن قيمة وعراقة هذا الصرح العلمي الكبير كي تكون مرآة الحاضر وعين المستقبل المشرق لبلدنا الغالي والحبيب علي قلوبنا جميعا مصر أم الدنيا. وأيد علي أيد هانبني بلدنا وأم الدنيا هتبقي أد الدنيا بإذن الله'
            ),
          ),
        ),
      ),
    );
  }
}
